cf_billing/Documents/энргИзменитьФормуУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьФормуУправленияМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргФормыУправленияМКД</xr:Item>
				<xr:Item>InformationRegister.энргСпособРаспределенияОбъемаМКДНаАбонентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФормыУправленияМКД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОбъемовВыполняетУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РаспределятьНаАбонентов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргИзменитьФормуУправленияМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти


#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаФормыУправленияМКД(Схема, Регистры)
	
	ИмяРегистра = "энргФормыУправленияМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргИзменитьФормуУправленияМКД.Дата
	|	КОНЕЦ КАК Период,
	|	энргИзменитьФормуУправленияМКД.Организация КАК Организация,
	|	энргИзменитьФормуУправленияМКД.Район КАК Район,
	|	энргИзменитьФормуУправленияМКД.МКД КАК МКД,
	|	энргИзменитьФормуУправленияМКД.ФормаУправления КАК ФормаУправления,
	|	энргИзменитьФормуУправленияМКД.УК КАК УК,
	|	энргИзменитьФормуУправленияМКД.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргИзменитьФормуУправленияМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	энргИзменитьФормуУправленияМКД.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК
	|ИЗ
	|	Документ.энргИзменитьФормуУправленияМКД КАК энргИзменитьФормуУправленияМКД
	|ГДЕ
	|	энргИзменитьФормуУправленияМКД.Ссылка В(&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСпособРаспределенияОбъемаМКДНаАбонентов(Схема, Регистры)
	
	ИмяРегистра = "энргСпособРаспределенияОбъемаМКДНаАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргИзменитьФормуУправленияМКД.Дата
	|	КОНЕЦ КАК Период,
	|	энргИзменитьФормуУправленияМКД.Организация КАК Организация,
	|	энргИзменитьФормуУправленияМКД.Район КАК Район,
	|	энргИзменитьФормуУправленияМКД.МКД КАК МКД,
	|	энргИзменитьФормуУправленияМКД.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргИзменитьФормуУправленияМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	энргИзменитьФормуУправленияМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргИзменитьФормуУправленияМКДТочкиУчета.РаспределятьНаАбонентов КАК Распределять
	|ИЗ
	|	Документ.энргИзменитьФормуУправленияМКД КАК энргИзменитьФормуУправленияМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьФормуУправленияМКД.ТочкиУчета КАК энргИзменитьФормуУправленияМКДТочкиУчета
	|		ПО энргИзменитьФормуУправленияМКД.Ссылка = энргИзменитьФормуУправленияМКДТочкиУчета.Ссылка
	|			И (энргИзменитьФормуУправленияМКД.Ссылка В (&мДокументы))
	|			И (энргИзменитьФормуУправленияМКДТочкиУчета.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ТипПараметраРавно", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргИзменитьФормуУправленияМКД.Ссылка КАК Ссылка,
	|	энргИзменитьФормуУправленияМКД.Организация КАК Организация,
	|	энргИзменитьФормуУправленияМКД.Район КАК Район,
	|	энргИзменитьФормуУправленияМКД.МКД КАК МКД,
	|	энргИзменитьФормуУправленияМКД.ФормаУправления КАК ФормаУправления,
	|	ВЫБОР
	|		КОГДА НЕ энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргИзменитьФормуУправленияМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргИзменитьФормуУправленияМКД.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргИзменитьФормуУправленияМКД КАК энргИзменитьФормуУправленияМКД
	|ГДЕ
	|	энргИзменитьФормуУправленияМКД.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаФормыУправленияМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСпособРаспределенияОбъемаМКДНаАбонентов(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'"); 
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", 								ДанныеСтроения.Организация);
	Запрос.УстановитьПараметр("Район", 										ДанныеСтроения.Район);
	Запрос.УстановитьПараметр("МКД", 										ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
